The number of conditions.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public int ConditionCount { get; }
  Visual Basic
Public ReadOnly Property ConditionCount As Integer
	Get
  Visual C++
public:
property int ConditionCount {
	int get ();
}
 See Also
  FabricationServiceButton Class
  Autodesk.Revit.DB Namespace